{
    "architectures": [
      "Qwen2VLForConditionalGeneration"
    ],
    "_attn_implementation": "eager",
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "vision_start_token_id": 151652,
    "vision_end_token_id": 151653,
    "vision_token_id": 151654,
    "image_token_id": 151655,
    "video_token_id": 151656,
    "hidden_act": "silu",
    "hidden_size": 1536,
    "initializer_range": 0.02,
    "intermediate_size": 8960,
    "max_position_embeddings": 512,
    "max_window_layers": 28,
    "model_type": "qwen2_vl",
    "num_attention_heads": 12,
    "num_hidden_layers": 28,
    "num_key_value_heads": 2,
    "rms_norm_eps": 1e-06,
    "rope_theta": 1000000.0,
    "sliding_window": 32768,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.41.2",
    "use_cache": true,
    "use_sliding_window": false,
    "vision_config": {
      "depth": 32,
      "embed_dim": 1280,
      "mlp_ratio": 4,
      "num_heads": 16,
      "in_chans": 3,
      "hidden_size": 1536,
      "patch_size": 14,
      "spatial_merge_size": 2,
      "spatial_patch_size": 14,
      "temporal_patch_size": 2
    },
    "rope_scaling": {
      "type": "mrope",
      "mrope_section": [
        16,
        24,
        24
      ]
    },
    "vocab_size": 151936
  }
  