{
  "architectures": [
    "MolmoForCausalLM"
  ],
  "attention_layer_norm": false,
  "auto_map": {
    "AutoConfig": "config_molmo.MolmoConfig",
    "AutoModelForCausalLM": "modeling_molmo.MolmoForCausalLM"
  },
  "clip_qkv": null,
  "embedding_size": 152064,
  "hidden_size": 3584,
  "initializer_range": 0.02,
  "intermediate_size": 37888,
  "layer_norm_eps": 1e-06,
  "layer_norm_type": "rms",
  "max_position_embeddings": 4096,
  "model_type": "molmo",
  "norm_after": false,
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "qkv_bias": true,
  "rope_theta": 1000000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.43.3",
  "use_cache": true,
  "use_position_ids": true,
  "vocab_size": 152064,
  "weight_tying": false
}