#loc = loc(unknown)
module @block_0 attributes {module.FLOPs = 5466131446464 : i64, module.chip = "ALL", module.platform = "ONNX", module.state = "TOP_F32", module.top_run_mode = "STATIC", module.weight_file = "block_0_top_f32_all_weight.npz"} {
  func.func @main(%arg0: tensor<1x{seq_length}x{hidden_size}xf32> loc(unknown), %arg1: tensor<1x{seq_length}xsi32> loc(unknown), %arg2: tensor<1x1x{seq_length}x{seq_length}xf32> loc(unknown)) -> (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<1x{seq_length}x{num_key_value_heads}x128xf32>, tensor<1x{seq_length}x{num_key_value_heads}x128xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = false, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "bgr", scale = [1.000000e+00, 1.000000e+00, 1.000000e+00]} : (tensor<1x{seq_length}x{hidden_size}xf32>) -> tensor<1x{seq_length}x{hidden_size}xf32> loc(#loc1)
    %2 = "top.Input"(%arg1) {do_preprocess = true} : (tensor<1x{seq_length}xsi32>) -> tensor<1x{seq_length}xf32> loc(#loc2)
    %3 = "top.Input"(%arg2) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = false, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "bgr", scale = [1.000000e+00, 1.000000e+00, 1.000000e+00]} : (tensor<1x1x{seq_length}x{seq_length}xf32>) -> tensor<1x1x{seq_length}x{seq_length}xf32> loc(#loc3)
    %4 = "top.Weight"() : () -> tensor<1x1x{hidden_size}xf32> loc(#loc4)
    %5 = "top.RMSNorm"(%1, %4) {eps = 9.9999999747524271E-7 : f64} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<1x1x{hidden_size}xf32>) -> tensor<1x{seq_length}x{hidden_size}xf32> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<{hidden_size}x{hidden_size}xf32> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<1x1x{hidden_size}xf32> loc(#loc7)
    %8 = "top.MatMul"(%5, %6, %7) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<{hidden_size}x{hidden_size}xf32>, tensor<1x1x{hidden_size}xf32>) -> tensor<1x{seq_length}x{hidden_size}xf32> loc(#loc8)
    %9 = "top.Weight"() : () -> tensor<{hidden_size}x512xf32> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<1x1x512xf32> loc(#loc10)
    %11 = "top.MatMul"(%5, %9, %10) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<{hidden_size}x512xf32>, tensor<1x1x512xf32>) -> tensor<1x{seq_length}x512xf32> loc(#loc11)
    %12 = "top.Weight"() : () -> tensor<{hidden_size}x512xf32> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<1x1x512xf32> loc(#loc13)
    %14 = "top.MatMul"(%5, %12, %13) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<{hidden_size}x512xf32>, tensor<1x1x512xf32>) -> tensor<1x{seq_length}x512xf32> loc(#loc14)
    %15 = "top.Reshape"(%8) {flatten_start_dim = -1 : i64, shape = [1, {seq_length}, {num_attention_heads}, 128]} : (tensor<1x{seq_length}x{hidden_size}xf32>) -> tensor<1x{seq_length}x{num_attention_heads}x128xf32> loc(#loc15)
    %16 = "top.Reshape"(%11) {flatten_start_dim = -1 : i64, shape = [1, {seq_length}, {num_key_value_heads}, 128]} : (tensor<1x{seq_length}x512xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x128xf32> loc(#loc16)
    %17 = "top.Reshape"(%14) {flatten_start_dim = -1 : i64, shape = [1, {seq_length}, {num_key_value_heads}, 128]} : (tensor<1x{seq_length}x512xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x128xf32> loc(#loc17)
    %18 = "top.Weight"() : () -> tensor<{seq_length}x1x128xf32> loc(#loc18)
    %19 = "top.Gather"(%18, %2) {axis = 0 : si32, is_scalar = false, keepdims = true} : (tensor<{seq_length}x1x128xf32>, tensor<1x{seq_length}xf32>) -> tensor<1x{seq_length}x1x128xf32> loc(#loc19)
    %20 = "top.Weight"() : () -> tensor<{seq_length}x1x128xf32> loc(#loc20)
    %21 = "top.Gather"(%20, %2) {axis = 0 : si32, is_scalar = false, keepdims = true} : (tensor<{seq_length}x1x128xf32>, tensor<1x{seq_length}xf32>) -> tensor<1x{seq_length}x1x128xf32> loc(#loc21)
    %22 = "top.Mul"(%15, %19) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{num_attention_heads}x128xf32>, tensor<1x{seq_length}x1x128xf32>) -> tensor<1x{seq_length}x{num_attention_heads}x128xf32> loc(#loc22)
    %23 = "top.Slice"(%15, %0, %0, %0) {axes = [], ends = [1, {seq_length}, {num_attention_heads}, 64], hasparamConvert_axes = [3], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x{seq_length}x{num_attention_heads}x128xf32>, none, none, none) -> tensor<1x{seq_length}x{num_attention_heads}x64xf32> loc(#loc23)
    %24 = "top.Slice"(%15, %0, %0, %0) {axes = [], ends = [1, {seq_length}, {num_attention_heads}, 2147482624], hasparamConvert_axes = [3], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x{seq_length}x{num_attention_heads}x128xf32>, none, none, none) -> tensor<1x{seq_length}x{num_attention_heads}x64xf32> loc(#loc24)
    %25 = "top.MulConst"(%24) {const_val = -1.000000e+00 : f64, do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{num_attention_heads}x64xf32>) -> tensor<1x{seq_length}x{num_attention_heads}x64xf32> loc(#loc25)
    %26 = "top.Concat"(%25, %23) {axis = 3 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x{seq_length}x{num_attention_heads}x64xf32>, tensor<1x{seq_length}x{num_attention_heads}x64xf32>) -> tensor<1x{seq_length}x{num_attention_heads}x128xf32> loc(#loc26)
    %27 = "top.Mul"(%26, %21) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{num_attention_heads}x128xf32>, tensor<1x{seq_length}x1x128xf32>) -> tensor<1x{seq_length}x{num_attention_heads}x128xf32> loc(#loc27)
    %28 = "top.Add"(%22, %27) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{num_attention_heads}x128xf32>, tensor<1x{seq_length}x{num_attention_heads}x128xf32>) -> tensor<1x{seq_length}x{num_attention_heads}x128xf32> loc(#loc28)
    %29 = "top.Mul"(%16, %19) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{num_key_value_heads}x128xf32>, tensor<1x{seq_length}x1x128xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x128xf32> loc(#loc29)
    %30 = "top.Slice"(%16, %0, %0, %0) {axes = [], ends = [1, {seq_length}, {num_key_value_heads}, 64], hasparamConvert_axes = [3], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x{seq_length}x{num_key_value_heads}x128xf32>, none, none, none) -> tensor<1x{seq_length}x{num_key_value_heads}x64xf32> loc(#loc30)
    %31 = "top.Slice"(%16, %0, %0, %0) {axes = [], ends = [1, {seq_length}, {num_key_value_heads}, 2147482624], hasparamConvert_axes = [3], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x{seq_length}x{num_key_value_heads}x128xf32>, none, none, none) -> tensor<1x{seq_length}x{num_key_value_heads}x64xf32> loc(#loc31)
    %32 = "top.MulConst"(%31) {const_val = -1.000000e+00 : f64, do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{num_key_value_heads}x64xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x64xf32> loc(#loc32)
    %33 = "top.Concat"(%32, %30) {axis = 3 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x{seq_length}x{num_key_value_heads}x64xf32>, tensor<1x{seq_length}x{num_key_value_heads}x64xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x128xf32> loc(#loc33)
    %34 = "top.Mul"(%33, %21) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{num_key_value_heads}x128xf32>, tensor<1x{seq_length}x1x128xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x128xf32> loc(#loc34)
    %35 = "top.Add"(%29, %34) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{num_key_value_heads}x128xf32>, tensor<1x{seq_length}x{num_key_value_heads}x128xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x128xf32> loc(#loc35)
    %36 = "top.Unsqueeze"(%35) {axes = [3]} : (tensor<1x{seq_length}x{num_key_value_heads}x128xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x1x128xf32> loc(#loc36)
    %37 = "top.Tile"(%36) {tile = [1, 1, 1, 7, 1]} : (tensor<1x{seq_length}x{num_key_value_heads}x1x128xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x7x128xf32> loc(#loc37)
    %38 = "top.Reshape"(%37) {flatten_start_dim = -1 : i64, shape = [1, {seq_length}, {num_attention_heads}, 128]} : (tensor<1x{seq_length}x{num_key_value_heads}x7x128xf32>) -> tensor<1x{seq_length}x{num_attention_heads}x128xf32> loc(#loc38)
    %39 = "top.Unsqueeze"(%17) {axes = [3]} : (tensor<1x{seq_length}x{num_key_value_heads}x128xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x1x128xf32> loc(#loc39)
    %40 = "top.Tile"(%39) {tile = [1, 1, 1, 7, 1]} : (tensor<1x{seq_length}x{num_key_value_heads}x1x128xf32>) -> tensor<1x{seq_length}x{num_key_value_heads}x7x128xf32> loc(#loc40)
    %41 = "top.Reshape"(%40) {flatten_start_dim = -1 : i64, shape = [1, {seq_length}, {num_attention_heads}, 128]} : (tensor<1x{seq_length}x{num_key_value_heads}x7x128xf32>) -> tensor<1x{seq_length}x{num_attention_heads}x128xf32> loc(#loc41)
    %42 = "top.Permute"(%28) {order = [0, 2, 1, 3]} : (tensor<1x{seq_length}x{num_attention_heads}x128xf32>) -> tensor<1x{num_attention_heads}x{seq_length}x128xf32> loc(#loc42)
    %43 = "top.Permute"(%38) {order = [0, 2, 3, 1]} : (tensor<1x{seq_length}x{num_attention_heads}x128xf32>) -> tensor<1x{num_attention_heads}x128x{seq_length}xf32> loc(#loc43)
    %44 = "top.MatMul"(%42, %43, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x{num_attention_heads}x{seq_length}x128xf32>, tensor<1x{num_attention_heads}x128x{seq_length}xf32>, none) -> tensor<1x{num_attention_heads}x{seq_length}x{seq_length}xf32> loc(#loc44)
    %45 = "top.MulConst"(%44) {const_val = 0.088388349161020605 : f64, do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{num_attention_heads}x{seq_length}x{seq_length}xf32>) -> tensor<1x{num_attention_heads}x{seq_length}x{seq_length}xf32> loc(#loc45)
    %46 = "top.Add"(%45, %3) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{num_attention_heads}x{seq_length}x{seq_length}xf32>, tensor<1x1x{seq_length}x{seq_length}xf32>) -> tensor<1x{num_attention_heads}x{seq_length}x{seq_length}xf32> loc(#loc46)
    %47 = "top.Softmax"(%46) {axis = 3 : si32, beta = 1.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero"} : (tensor<1x{num_attention_heads}x{seq_length}x{seq_length}xf32>) -> tensor<1x{num_attention_heads}x{seq_length}x{seq_length}xf32> loc(#loc47)
    %48 = "top.Permute"(%41) {order = [0, 2, 1, 3]} : (tensor<1x{seq_length}x{num_attention_heads}x128xf32>) -> tensor<1x{num_attention_heads}x{seq_length}x128xf32> loc(#loc48)
    %49 = "top.MatMul"(%47, %48, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x{num_attention_heads}x{seq_length}x{seq_length}xf32>, tensor<1x{num_attention_heads}x{seq_length}x128xf32>, none) -> tensor<1x{num_attention_heads}x{seq_length}x128xf32> loc(#loc49)
    %50 = "top.Permute"(%49) {order = [0, 2, 1, 3]} : (tensor<1x{num_attention_heads}x{seq_length}x128xf32>) -> tensor<1x{seq_length}x{num_attention_heads}x128xf32> loc(#loc50)
    %51 = "top.Reshape"(%50) {flatten_start_dim = -1 : i64, shape = [1, {seq_length}, {hidden_size}]} : (tensor<1x{seq_length}x{num_attention_heads}x128xf32>) -> tensor<1x{seq_length}x{hidden_size}xf32> loc(#loc51)
    %52 = "top.Weight"() : () -> tensor<{hidden_size}x{hidden_size}xf32> loc(#loc52)
    %53 = "top.MatMul"(%51, %52, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<{hidden_size}x{hidden_size}xf32>, none) -> tensor<1x{seq_length}x{hidden_size}xf32> loc(#loc53)
    %54 = "top.Add"(%1, %53) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<1x{seq_length}x{hidden_size}xf32>) -> tensor<1x{seq_length}x{hidden_size}xf32> loc(#loc54)
    %55 = "top.Weight"() : () -> tensor<1x1x{hidden_size}xf32> loc(#loc55)
    %56 = "top.RMSNorm"(%54, %55) {eps = 9.9999999747524271E-7 : f64} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<1x1x{hidden_size}xf32>) -> tensor<1x{seq_length}x{hidden_size}xf32> loc(#loc56)
    %57 = "top.Weight"() : () -> tensor<{hidden_size}x{intermediate_size}xf32> loc(#loc57)
    %58 = "top.MatMul"(%56, %57, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<{hidden_size}x{intermediate_size}xf32>, none) -> tensor<1x{seq_length}x{intermediate_size}xf32> loc(#loc58)
    %59 = "top.SiLU"(%58) : (tensor<1x{seq_length}x{intermediate_size}xf32>) -> tensor<1x{seq_length}x{intermediate_size}xf32> loc(#loc59)
    %60 = "top.Weight"() : () -> tensor<{hidden_size}x{intermediate_size}xf32> loc(#loc60)
    %61 = "top.MatMul"(%56, %60, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<{hidden_size}x{intermediate_size}xf32>, none) -> tensor<1x{seq_length}x{intermediate_size}xf32> loc(#loc61)
    %62 = "top.Mul"(%59, %61) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{intermediate_size}xf32>, tensor<1x{seq_length}x{intermediate_size}xf32>) -> tensor<1x{seq_length}x{intermediate_size}xf32> loc(#loc62)
    %63 = "top.Weight"() : () -> tensor<{intermediate_size}x{hidden_size}xf32> loc(#loc63)
    %64 = "top.MatMul"(%62, %63, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x{seq_length}x{intermediate_size}xf32>, tensor<{intermediate_size}x{hidden_size}xf32>, none) -> tensor<1x{seq_length}x{hidden_size}xf32> loc(#loc64)
    %65 = "top.Add"(%54, %64) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x{seq_length}x{hidden_size}xf32>, tensor<1x{seq_length}x{hidden_size}xf32>) -> tensor<1x{seq_length}x{hidden_size}xf32> loc(#loc65)
    return %65, %35, %17 : tensor<1x{seq_length}x{hidden_size}xf32>, tensor<1x{seq_length}x{num_key_value_heads}x128xf32>, tensor<1x{seq_length}x{num_key_value_heads}x128xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("input_states")
#loc2 = loc("position_ids")
#loc3 = loc("attention_mask")
#loc4 = loc("input_layernorm.weight")
#loc5 = loc("/input_layernorm/Mul_1_output_0_Mul")
#loc6 = loc("/self_attn/q_proj/Transpose_output_0")
#loc7 = loc("self_attn.q_proj.bias")
#loc8 = loc("/self_attn/q_proj/Add_output_0_Add")
#loc9 = loc("/self_attn/k_proj/Transpose_output_0")
#loc10 = loc("self_attn.k_proj.bias")
#loc11 = loc("/self_attn/k_proj/Add_output_0_Add")
#loc12 = loc("/self_attn/v_proj/Transpose_output_0")
#loc13 = loc("self_attn.v_proj.bias")
#loc14 = loc("/self_attn/v_proj/Add_output_0_Add")
#loc15 = loc("/self_attn/Reshape_output_0_Reshape")
#loc16 = loc("/self_attn/Reshape_1_output_0_Reshape")
#loc17 = loc("past_v_Reshape")
#loc18 = loc("/self_attn/Constant_6_output_0")
#loc19 = loc("/self_attn/Gather_output_0_Gather")
#loc20 = loc("/self_attn/Constant_7_output_0")
#loc21 = loc("/self_attn/Gather_1_output_0_Gather")
#loc22 = loc("/self_attn/Mul_output_0_Mul")
#loc23 = loc("/self_attn/Slice_output_0_Slice")
#loc24 = loc("/self_attn/Slice_1_output_0_Slice")
#loc25 = loc("/self_attn/Neg_output_0_Neg")
#loc26 = loc("/self_attn/Concat_3_output_0_Concat")
#loc27 = loc("/self_attn/Mul_1_output_0_Mul")
#loc28 = loc("/self_attn/Add_output_0_Add")
#loc29 = loc("/self_attn/Mul_2_output_0_Mul")
#loc30 = loc("/self_attn/Slice_2_output_0_Slice")
#loc31 = loc("/self_attn/Slice_3_output_0_Slice")
#loc32 = loc("/self_attn/Neg_1_output_0_Neg")
#loc33 = loc("/self_attn/Concat_4_output_0_Concat")
#loc34 = loc("/self_attn/Mul_3_output_0_Mul")
#loc35 = loc("past_k_Add")
#loc36 = loc("/self_attn/Unsqueeze_28_output_0_Unsqueeze")
#loc37 = loc("/self_attn/Expand_output_0_Expand")
#loc38 = loc("/self_attn/Reshape_4_output_0_Reshape")
#loc39 = loc("/self_attn/Unsqueeze_38_output_0_Unsqueeze")
#loc40 = loc("/self_attn/Expand_1_output_0_Expand")
#loc41 = loc("/self_attn/Reshape_6_output_0_Reshape")
#loc42 = loc("/self_attn/Transpose_output_0_Transpose")
#loc43 = loc("/self_attn/Transpose_1_output_0_Transpose")
#loc44 = loc("/self_attn/MatMul_output_0_MatMul")
#loc45 = loc("/self_attn/Div_output_0_Div")
#loc46 = loc("/self_attn/Add_2_output_0_Add")
#loc47 = loc("/self_attn/Softmax_output_0_Softmax")
#loc48 = loc("/self_attn/Transpose_2_output_0_Transpose")
#loc49 = loc("/self_attn/MatMul_1_output_0_MatMul")
#loc50 = loc("/self_attn/Transpose_3_output_0_Transpose")
#loc51 = loc("/self_attn/Reshape_7_output_0_Reshape")
#loc52 = loc("/self_attn/o_proj/Transpose_output_0")
#loc53 = loc("/self_attn/o_proj/MatMul_output_0_MatMul")
#loc54 = loc("/Add_output_0_Add")
#loc55 = loc("post_attention_layernorm.weight")
#loc56 = loc("/post_attention_layernorm/Mul_1_output_0_Mul")
#loc57 = loc("/mlp/gate_proj/Transpose_output_0")
#loc58 = loc("/mlp/gate_proj/MatMul_output_0_MatMul")
#loc59 = loc("/mlp/act_fn/Mul_output_0_Mul")
#loc60 = loc("/mlp/up_proj/Transpose_output_0")
#loc61 = loc("/mlp/up_proj/MatMul_output_0_MatMul")
#loc62 = loc("/mlp/Mul_output_0_Mul")
#loc63 = loc("/mlp/down_proj/Transpose_output_0")
#loc64 = loc("/mlp/down_proj/MatMul_output_0_MatMul")
#loc65 = loc("hidden_states_Add")

