{
  "architectures": [
    "MiniCPMV4_6ForConditionalGeneration"
  ],
  "bos_token_id": null,
  "drop_vision_last_layer": false,
  "dtype": "bfloat16",
  "eos_token_id": 248044,
  "image_size": 1120,
  "image_token_id": 248056,
  "insert_layer_id": 6,
  "merge_kernel_size": [
    2,
    2
  ],
  "merger_times": 1,
  "model_type": "minicpmv4_6",
  "pad_token_id": null,
  "patch_size": 14,
  "quantization_config": {
    "bits": 4,
    "group_size": 128,
    "modules_to_not_convert": [
      "in_proj_b",
      "in_proj_a",
      "model.vision_tower",
      "model.merger",
      "lm_head"
    ],
    "quant_method": "awq",
    "version": "gemm",
    "zero_point": true
  },
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attn_output_gate": true,
    "bos_token_id": null,
    "dtype": "bfloat16",
    "eos_token_id": null,
    "full_attention_interval": 4,
    "head_dim": 256,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 3584,
    "layer_types": [
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention"
    ],
    "linear_conv_kernel_dim": 4,
    "linear_key_head_dim": 128,
    "linear_num_key_heads": 16,
    "linear_num_value_heads": 16,
    "linear_value_head_dim": 128,
    "mamba_ssm_dtype": "float32",
    "max_position_embeddings": 262144,
    "mlp_only_layers": [],
    "model_type": "qwen3_5_text",
    "mtp_num_hidden_layers": 1,
    "mtp_use_dedicated_embeddings": false,
    "num_attention_heads": 8,
    "num_hidden_layers": 24,
    "num_key_value_heads": 2,
    "pad_token_id": null,
    "partial_rotary_factor": 0.25,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "partial_rotary_factor": 0.25,
      "rope_theta": 10000000,
      "rope_type": "default"
    },
    "tie_word_embeddings": true,
    "use_cache": true,
    "vocab_size": 248094
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.7.0",
  "video_token_id": 248057,
  "vision_config": {
    "attention_dropout": 0.0,
    "dtype": "bfloat16",
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "image_size": 980,
    "insert_layer_id": 6,
    "intermediate_size": 4304,
    "layer_norm_eps": 1e-06,
    "model_type": "minicpmv4_6_vision",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 27,
    "patch_size": 14,
    "window_kernel_size": [
      2,
      2
    ]
  }
}
