{
  "metadata": {
    "total_size": 16794189824
  },
  "weight_map": {
    "audio_tower.conv1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.conv1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.conv2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.conv2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.embed_positions.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.0.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.1.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.10.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.11.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.12.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.13.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.14.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.15.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.16.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.17.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.18.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.19.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.2.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.20.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.21.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.22.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.23.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.24.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.25.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.26.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.27.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.28.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.29.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.3.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.30.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.31.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.4.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.5.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.6.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.7.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.8.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.fc1.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.fc1.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.fc2.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.fc2.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.final_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.final_layer_norm.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.self_attn.out_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.self_attn.out_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.self_attn_layer_norm.bias": "model-00001-of-00005.safetensors",
    "audio_tower.layers.9.self_attn_layer_norm.weight": "model-00001-of-00005.safetensors",
    "language_model.lm_head.weight": "model-00005-of-00005.safetensors",
    "language_model.model.embed_tokens.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.input_layernorm.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.mlp.down_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.mlp.gate_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.mlp.up_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.post_attention_layernorm.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.self_attn.k_proj.bias": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.self_attn.o_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "language_model.model.layers.0.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.input_layernorm.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.mlp.down_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.mlp.gate_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.mlp.up_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.post_attention_layernorm.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.self_attn.k_proj.bias": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.self_attn.k_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.self_attn.o_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.self_attn.q_proj.bias": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.self_attn.q_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.self_attn.v_proj.bias": "model-00001-of-00005.safetensors",
    "language_model.model.layers.1.self_attn.v_proj.weight": "model-00001-of-00005.safetensors",
    "language_model.model.layers.10.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.self_attn.k_proj.bias": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.self_attn.k_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.self_attn.o_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.self_attn.q_proj.bias": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.self_attn.q_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.self_attn.v_proj.bias": "model-00002-of-00005.safetensors",
    "language_model.model.layers.10.self_attn.v_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.self_attn.k_proj.bias": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.self_attn.k_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.self_attn.o_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.self_attn.q_proj.bias": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.self_attn.q_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.self_attn.v_proj.bias": "model-00002-of-00005.safetensors",
    "language_model.model.layers.11.self_attn.v_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.mlp.down_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.mlp.gate_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.mlp.up_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.post_attention_layernorm.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.self_attn.k_proj.bias": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.self_attn.k_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.self_attn.o_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.self_attn.q_proj.bias": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.self_attn.q_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.self_attn.v_proj.bias": "model-00002-of-00005.safetensors",
    "language_model.model.layers.12.self_attn.v_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.13.input_layernorm.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.13.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.13.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.13.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.13.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.13.self_attn.k_proj.bias": "model-00003-of-00005.safetensors",
    "language_model.model.layers.13.self_attn.k_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.13.self_attn.o_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.13.self_attn.q_proj.bias": "model-00003-of-00005.safetensors",
    "language_model.model.layers.13.self_attn.q_proj.weight": "model-00002-of-00005.safetensors",
    "language_model.model.layers.13.self_attn.v_proj.bias": "model-00003-of-00005.safetensors",
    "language_model.model.layers.13.self_attn.v_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.mlp.up_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.post_attention_layernorm.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.self_attn.k_proj.bias": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.self_attn.k_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.self_attn.o_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.self_attn.q_proj.bias": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.self_attn.q_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.self_attn.v_proj.bias": "model-00003-of-00005.safetensors",
    "language_model.model.layers.14.self_attn.v_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.15.input_layernorm.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.15.mlp.down_proj.weight": "model-00003-of-00005.safetensors",
    "language_model.model.layers.15.mlp.gate_proj.weight": "model-00003-of-00005.safetensors",
