{
  "architectures": [
    "FalconPerceptionForSegmentation"
  ],
  "auto_map": {
    "AutoConfig": "configuration_falcon_perception.FalconPerceptionConfig",
    "AutoModelForCausalLM": "modeling_falcon_perception.FalconPerceptionForSegmentation"
  },
  "model_type": "falcon_perception",
  "torch_dtype": "float32",
  "dim": 1024,
  "n_layers": 28,
  "n_heads": 16,
  "head_dim": 128,
  "n_kv_heads": 8,
  "vocab_size": 65536,
  "ffn_dim": 3072,
  "norm_eps": 1e-05,
  "max_seq_len": 8192,
  "rope_theta": 10000,
  "channel_size": 3,
  "spatial_patch_size": 16,
  "temporal_patch_size": 1,
  "do_segmentation": true,
  "segm_out_dim": 256,
  "num_segm_layers": 3,
  "coord_enc_dim": 512,
  "coord_dec_dim": 8192,
  "coord_out_dim": 2048,
  "coord_token_id": 240,
  "size_enc_dim": 512,
  "size_dec_dim": 8192,
  "size_out_dim": 2048,
  "size_token_id": 241,
  "seg_token_id": 262,
  "eos_id": 11,
  "img_id": 227,
  "image_cls_token_id": 244,
  "image_reg_1_token_id": 245,
  "image_reg_2_token_id": 246,
  "image_reg_3_token_id": 247,
  "image_reg_4_token_id": 248,
  "img_end_id": 230
}