{
  "absence_token": "<|absence|>",
  "additional_special_tokens": [
    "<|pad|>",
    ">>ABSTRACT<<",
    ">>INTRODUCTION<<",
    ">>SUMMARY<<",
    ">>COMMENT<<",
    ">>ANSWER<<",
    ">>QUESTION<<",
    ">>DOMAIN<<",
    ">>PREFIX<<",
    ">>SUFFIX<<",
    ">>MIDDLE<<",
    "<|finetune_right_pad_id|>",
    "<|start_header_id|>",
    "<|end_header_id|>",
    "<|eom_id|>",
    "<|eot_id|>",
    "<|begin_of_text|>",
    ">>TITLE<<",
    "<tool_response>",
    "</tool_response>",
    "<tool_call>",
    "</tool_call>",
    "<schema>",
    "</schema>",
    "<scratch_pad>",
    "</scratch_pad>",
    "<thinking>",
    "</thinking>",
    "<explanation>",
    "</explanation>",
    "<file_sep>",
    "<repo_name>",
    ">>UNUSED_119<<",
    ">>UNUSED_120<<",
    "<|image|>",
    "<|image_row_sep|>",
    "<|start_of_image|>",
    "<|end_of_image|>",
    "<|start_of_video|>",
    "<|end_of_video|>",
    "<|frame_sep|>",
    "<|start_of_turn|>",
    "<|end_of_turn|>",
    "<|start_of_diffusion_query|>",
    "<|end_of_diffusion_query|>",
    "<|diffusion_query|>",
    "<|object|>",
    "<|coord|>",
    "<|size|>",
    "<|perceive|>",
    "<|image_mask_token|>",
    "<|image_cls|>",
    "<|image_reg_1|>",
    "<|image_reg_2|>",
    "<|image_reg_3|>",
    "<|image_reg_4|>",
    "<|image_reg_5|>",
    "<|image_reg_6|>",
    "<|image_reg_7|>",
    "<|image_reg_8|>",
    "<|DET|>",
    "<|POINTING|>",
    "<|OCR_GROUNDING|>",
    "<|OCR_DOC_PARSER|>",
    "<|OCR_PLAIN|>",
    "<|REF_SEG|>",
    "<|POINT_REF_SEG|>",
    "<|CAPTION|>",
    "<|DETAILED_CAPTION|>",
    "<|seg|>",
    "<|end_of_query|>",
    "<|start_of_query|>",
    "<|task_sep|>",
    "<|SEMANTIC_SEG_TASK|>",
    "<|semantic_seg|>",
    "<|presence|>",
    "<|absence|>",
    ">>UNUSED_258<<",
    ">>UNUSED_259<<",
    ">>UNUSED_260<<",
    ">>UNUSED_261<<",
    ">>UNUSED_262<<",
    ">>UNUSED_263<<",
    ">>UNUSED_264<<",
    ">>UNUSED_265<<",
    ">>UNUSED_266<<",
    ">>UNUSED_267<<",
    ">>UNUSED_268<<",
    ">>UNUSED_269<<",
    ">>UNUSED_270<<",
    ">>UNUSED_271<<",
    ">>UNUSED_272<<",
    ">>UNUSED_273<<",
    ">>UNUSED_274<<",
    ">>UNUSED_275<<",
    ">>UNUSED_276<<",
    ">>UNUSED_277<<",
    ">>UNUSED_278<<",
    ">>UNUSED_279<<",
    ">>UNUSED_280<<",
    ">>UNUSED_281<<",
    ">>UNUSED_282<<",
    ">>UNUSED_283<<",
    ">>UNUSED_284<<",
    ">>UNUSED_285<<",
    ">>UNUSED_286<<",
    ">>UNUSED_287<<",
    ">>UNUSED_288<<",
    ">>UNUSED_289<<",
    ">>UNUSED_290<<",
    ">>UNUSED_291<<",
    ">>UNUSED_292<<",
    ">>UNUSED_293<<",
    ">>UNUSED_294<<",
    ">>UNUSED_295<<",
    ">>UNUSED_296<<",
    ">>UNUSED_297<<",
    ">>UNUSED_298<<",
    ">>UNUSED_299<<",
    ">>UNUSED_300<<",
    ">>UNUSED_301<<",
    ">>UNUSED_302<<",
    ">>UNUSED_303<<",
    ">>UNUSED_304<<",
    ">>UNUSED_305<<",
    ">>UNUSED_306<<",
    ">>UNUSED_307<<",
    ">>UNUSED_308<<",
    ">>UNUSED_309<<",
    ">>UNUSED_310<<",
    ">>UNUSED_311<<",
    ">>UNUSED_312<<",
    ">>UNUSED_313<<",
    ">>UNUSED_314<<",
    ">>UNUSED_315<<",
    ">>UNUSED_316<<",
    ">>UNUSED_317<<",
    ">>UNUSED_318<<",
    ">>UNUSED_319<<",
    ">>UNUSED_320<<",
    ">>UNUSED_321<<",
    ">>UNUSED_322<<",
    ">>UNUSED_323<<",
    ">>UNUSED_324<<",
    ">>UNUSED_325<<",
    ">>UNUSED_326<<",
    ">>UNUSED_327<<",
    ">>UNUSED_328<<",
    ">>UNUSED_329<<",
    ">>UNUSED_330<<",
    ">>UNUSED_331<<",
    ">>UNUSED_332<<",
    ">>UNUSED_333<<",
    ">>UNUSED_334<<",
    ">>UNUSED_335<<",
    ">>UNUSED_336<<",
    ">>UNUSED_337<<",
    ">>UNUSED_338<<",
    ">>UNUSED_339<<",
    ">>UNUSED_340<<",
    ">>UNUSED_341<<",
    ">>UNUSED_342<<",
    ">>UNUSED_343<<",
    ">>UNUSED_344<<",
    ">>UNUSED_345<<",
    ">>UNUSED_346<<",
    ">>UNUSED_347<<",
    ">>UNUSED_348<<",
    ">>UNUSED_349<<",
    ">>UNUSED_350<<",
    ">>UNUSED_351<<",
    ">>UNUSED_352<<",
    ">>UNUSED_353<<",
    ">>UNUSED_354<<",
    ">>UNUSED_355<<",
    ">>UNUSED_356<<",
    ">>UNUSED_357<<",
    ">>UNUSED_358<<",
    ">>UNUSED_359<<",
    ">>UNUSED_360<<",
    ">>UNUSED_361<<",
    ">>UNUSED_362<<",
    ">>UNUSED_363<<",
    ">>UNUSED_364<<",
    ">>UNUSED_365<<",
    ">>UNUSED_366<<",
    ">>UNUSED_367<<",
    ">>UNUSED_368<<",
    ">>UNUSED_369<<",
    ">>UNUSED_370<<",
    ">>UNUSED_371<<",
    ">>UNUSED_372<<",
    ">>UNUSED_373<<",
    ">>UNUSED_374<<",
    ">>UNUSED_375<<",
    ">>UNUSED_376<<",
    ">>UNUSED_377<<",
    ">>UNUSED_378<<",
    ">>UNUSED_379<<",
    ">>UNUSED_380<<",
    ">>UNUSED_381<<",
    ">>UNUSED_382<<",
    ">>UNUSED_383<<",
    ">>UNUSED_384<<",
    ">>UNUSED_385<<",
    ">>UNUSED_386<<",
    ">>UNUSED_387<<",
    ">>UNUSED_388<<",
    ">>UNUSED_389<<",
    ">>UNUSED_390<<",
    ">>UNUSED_391<<",
    ">>UNUSED_392<<",
    ">>UNUSED_393<<",
    ">>UNUSED_394<<",
    ">>UNUSED_395<<",
    ">>UNUSED_396<<",
    ">>UNUSED_397<<",
    ">>UNUSED_398<<",
    ">>UNUSED_399<<",
    ">>UNUSED_400<<",
    ">>UNUSED_401<<",
    ">>UNUSED_402<<",
    ">>UNUSED_403<<",
    ">>UNUSED_404<<",
    ">>UNUSED_405<<",
    ">>UNUSED_406<<",
    ">>UNUSED_407<<",
    ">>UNUSED_408<<",
    ">>UNUSED_409<<",
    ">>UNUSED_410<<",
    ">>UNUSED_411<<",
    ">>UNUSED_412<<",
    ">>UNUSED_413<<",
    ">>UNUSED_414<<",
    ">>UNUSED_415<<",
    ">>UNUSED_416<<",
    ">>UNUSED_417<<",
    ">>UNUSED_418<<",
    ">>UNUSED_419<<",
    ">>UNUSED_420<<",
    ">>UNUSED_421<<",
    ">>UNUSED_422<<",
    ">>UNUSED_423<<",
    ">>UNUSED_424<<",
    ">>UNUSED_425<<",
    ">>UNUSED_426<<",
    ">>UNUSED_427<<",
    ">>UNUSED_428<<",
    ">>UNUSED_429<<",
    ">>UNUSED_430<<",
    ">>UNUSED_431<<",
    ">>UNUSED_432<<",
    ">>UNUSED_433<<",
    ">>UNUSED_434<<",
    ">>UNUSED_435<<",
    ">>UNUSED_436<<",
    ">>UNUSED_437<<",
    ">>UNUSED_438<<",
    ">>UNUSED_439<<",
    ">>UNUSED_440<<",
    ">>UNUSED_441<<",
    ">>UNUSED_442<<",
    ">>UNUSED_443<<",
    ">>UNUSED_444<<",
    ">>UNUSED_445<<",
    ">>UNUSED_446<<",
    ">>UNUSED_447<<",
    ">>UNUSED_448<<",
    ">>UNUSED_449<<",
    ">>UNUSED_450<<",
    ">>UNUSED_451<<",
    ">>UNUSED_452<<",
    ">>UNUSED_453<<",
    ">>UNUSED_454<<",
    ">>UNUSED_455<<",
    ">>UNUSED_456<<",
    ">>UNUSED_457<<",
    ">>UNUSED_458<<",
    ">>UNUSED_459<<",
    ">>UNUSED_460<<",
    ">>UNUSED_461<<",
    ">>UNUSED_462<<",
    ">>UNUSED_463<<",
    ">>UNUSED_464<<",
    ">>UNUSED_465<<",
    ">>UNUSED_466<<",
    ">>UNUSED_467<<",
    ">>UNUSED_468<<",
    ">>UNUSED_469<<",
    ">>UNUSED_470<<",
    ">>UNUSED_471<<",
    ">>UNUSED_472<<",
    ">>UNUSED_473<<",
    ">>UNUSED_474<<",
    ">>UNUSED_475<<",
    ">>UNUSED_476<<",
    ">>UNUSED_477<<",
    ">>UNUSED_478<<",
    ">>UNUSED_479<<",
    ">>UNUSED_480<<",
    ">>UNUSED_481<<",
    ">>UNUSED_482<<",
    ">>UNUSED_483<<",
    ">>UNUSED_484<<",
    ">>UNUSED_485<<",
    ">>UNUSED_486<<",
    ">>UNUSED_487<<",
    ">>UNUSED_488<<",
    ">>UNUSED_489<<",
    ">>UNUSED_490<<",
    ">>UNUSED_491<<",
    ">>UNUSED_492<<",
    ">>UNUSED_493<<",
    ">>UNUSED_494<<",
    ">>UNUSED_495<<",
    ">>UNUSED_496<<",
    ">>UNUSED_497<<",
    ">>UNUSED_498<<",
    ">>UNUSED_499<<",
    ">>UNUSED_500<<",
    ">>UNUSED_501<<",
    ">>UNUSED_502<<",
    ">>UNUSED_503<<",
    ">>UNUSED_504<<",
    ">>UNUSED_505<<",
    ">>UNUSED_506<<",
    ">>UNUSED_507<<",
    ">>UNUSED_508<<",
    ">>UNUSED_509<<",
    ">>UNUSED_510<<",
    ">>UNUSED_511<<"
  ],
  "caption_token": "<|CAPTION|>",
  "coord_token": "<|coord|>",
  "det_token": "<|DET|>",
  "detailed_caption_token": "<|DETAILED_CAPTION|>",
  "diffusion_query_token": "<|diffusion_query|>",
  "end_of_diffusion_query_token": "<|end_of_diffusion_query|>",
  "end_of_image_token": "<|end_of_image|>",
  "end_of_query_token": "<|end_of_query|>",
  "end_of_turn_token": "<|end_of_turn|>",
  "end_of_video_token": "<|end_of_video|>",
  "eos_token": "<|end_of_text|>",
  "frame_sep_token": "<|frame_sep|>",
  "image_cls_token": "<|image_cls|>",
  "image_mask_token": "<|image_mask_token|>",
  "image_reg_1_token": "<|image_reg_1|>",
  "image_reg_2_token": "<|image_reg_2|>",
  "image_reg_3_token": "<|image_reg_3|>",
  "image_reg_4_token": "<|image_reg_4|>",
  "image_reg_5_token": "<|image_reg_5|>",
  "image_reg_6_token": "<|image_reg_6|>",
  "image_reg_7_token": "<|image_reg_7|>",
  "image_reg_8_token": "<|image_reg_8|>",
  "image_row_sep_token": "<|image_row_sep|>",
  "image_token": "<|image|>",
  "object_token": "<|object|>",
  "ocr_doc_parser_token": "<|OCR_DOC_PARSER|>",
  "ocr_grounding_token": "<|OCR_GROUNDING|>",
  "ocr_plain_token": "<|OCR_PLAIN|>",
  "pad_token": "<|pad|>",
  "perceive_token": "<|perceive|>",
  "point_ref_seg_token": "<|POINT_REF_SEG|>",
  "pointing_token": "<|POINTING|>",
  "presence_token": "<|presence|>",
  "ref_seg_token": "<|REF_SEG|>",
  "seg_token": "<|seg|>",
  "semantic_seg_task_token": "<|SEMANTIC_SEG_TASK|>",
  "semantic_seg_token": "<|semantic_seg|>",
  "size_token": "<|size|>",
  "start_of_diffusion_query_token": "<|start_of_diffusion_query|>",
  "start_of_image_token": "<|start_of_image|>",
  "start_of_query_token": "<|start_of_query|>",
  "start_of_turn_token": "<|start_of_turn|>",
  "start_of_video_token": "<|start_of_video|>",
  "task_sep_token": "<|task_sep|>"
}
