{
  "architectures": [
    "QWenLMHeadModel"
  ],
  "auto_map": {
    "AutoConfig": "configuration_qwen.QWenConfig",
    "AutoModelForCausalLM": "modeling_qwen.QWenLMHeadModel"
  },
  "attn_dropout_prob": 0.0,
  "bf16": false,
  "emb_dropout_prob": 0.0,
  "fp16": false,
  "fp32": false,
  "hidden_size": 8192,
  "intermediate_size": 49152,
  "initializer_range": 0.02,
  "kv_channels": 128,
  "layer_norm_epsilon": 1e-06,
  "max_position_embeddings": 32768,
  "model_type": "qwen",
  "no_bias": true,
  "num_attention_heads": 64,
  "num_hidden_layers": 80,
  "onnx_safe": null,
  "rope_theta": 1000000,
  "rotary_emb_base": 1000000,
  "rotary_pct": 1.0,
  "scale_attn_weights": true,
  "seq_length": 32768,
  "tie_word_embeddings": false,
  "tokenizer_class": "QWenTokenizer",
  "transformers_version": "4.32.0",
  "use_cache": true,
  "use_dynamic_ntk": false,
  "use_flash_attn": "auto",
  "use_logn_attn": false,
  "vocab_size": 152064
}